/*          **Задача 63:** Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от 1 до N.
N = 5 -> "1, 2, 3, 4, 5"
N = 6 -> "1, 2, 3, 4, 5, 6"           */
/*
int a;
Console.Write($"Введите число: ");
int.TryParse(Console.ReadLine()!, out a);

PrintNumbers(1, a);

void PrintNumbers(int _start, int _end)
{
    if (_start == _end)
    {
        Console.Write($"{_start}");
        PrintNumbers(_start + 1, _end);
    }
}       */

